# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 8-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]

  - [2, 1, Conv, [64, 3, 2]] # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 13-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 15-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 17-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 19-P5/32
  - [-1, 3, C2f, [1024, True]]

  - [[5, 14], 1, Concat, [1]]  # 21 cat backbone P2
  - [[7, 16], 1, Concat, [1]]  # 22 cat backbone P3
  - [[9, 18], 1, Concat, [1]]  # 23 cat backbone P4
  - [[11, 20], 1, Concat, [1]]  # 24 cat backbone P5

  - [-1, 1, SPPF, [1024, 5]] # 25
  - [-1, 1, PSA, [1024]] # 26

# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 23], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 22], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 32 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 35 (P2/4-xsmall)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 32], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 38 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 29], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 41 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 26], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 44 (P5/32-large)

  - [[35, 38, 41, 44], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
