# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 8-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 1, PSA, [1024]] # 13

  - [2, 1, Conv, [64, 3, 2]] # 14-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 15-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 17-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 19-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 21-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 23
  - [-1, 1, PSA, [1024]] # 24

# YOLOv10.0n head
head:
  - [13, 1, ChannelAttention_HSFPN, [4]] # 25
  - [-1, 1, nn.Conv2d, [256, 1]] # 26
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 27
 
  - [9, 1, ChannelAttention_HSFPN, [4]] # 28
  - [-1, 1, nn.Conv2d, [256, 1]] # 29
  - [27, 1, ChannelAttention_HSFPN, [4, False]] # 30
  - [[-1, -2], 1, Multiply, []] # 31
  - [[-1, 27], 1, Add_HSFPN, []] # 32
  - [-1, 3, C2fCIB, [256, 1, True]] # 33 P4/16
 
  - [27, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 34
  - [7, 1, ChannelAttention_HSFPN, [4]] # 35
  - [-1, 1, nn.Conv2d, [256, 1]] # 36
  - [34, 1, ChannelAttention_HSFPN, [4, False]] # 37
  - [[-1, -2], 1, Multiply, []] # 38
  - [[-1, 34], 1, Add_HSFPN, []] # 39
  - [-1, 3, C2fCIB, [256, 1, True]] # 40 P3/16

  - [24, 1, ChannelAttention_HSFPN, [4]] # 41
  - [-1, 1, nn.Conv2d, [256, 1]] # 42
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 43
 
  - [20, 1, ChannelAttention_HSFPN, [4]] # 44
  - [-1, 1, nn.Conv2d, [256, 1]] # 45
  - [43, 1, ChannelAttention_HSFPN, [4, False]] # 46
  - [[-1, -2], 1, Multiply, []] # 47
  - [[-1, 43], 1, Add_HSFPN, []] # 48
  - [-1, 3, C2fCIB, [256, 1, True]] # 49 P4/16
 
  - [43, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 50
  - [18, 1, ChannelAttention_HSFPN, [4]] # 51
  - [-1, 1, nn.Conv2d, [256, 1]] # 52
  - [50, 1, ChannelAttention_HSFPN, [4, False]] # 53
  - [[-1, -2], 1, Multiply, []] # 54
  - [[-1, 50], 1, Add_HSFPN, []] # 55
  - [-1, 3, C2fCIB, [256, 1, True]] # 56 P3/16

  - [[26, 42], 1, Concat, [1]]  # 57 cat backbone P3
  - [[33, 49], 1, Concat, [1]]  # 58 cat backbone P4
  - [[40, 56], 1, Concat, [1]]  # 59 cat backbone P5

  - [[57, 58, 59], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
