# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

    # Visible
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]] # 5
    # infrared
  - [2, 1, Conv, [64, 3, 2]] # 6-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 7-P2/4
  - [-1, 3, C2f, [128, True]] # 8

  # transformer fusion
  - [ [ 5,8 ], 1, CFT, [ 128 ] ] # 9-P2/4
  - [ [ 5,9 ], 1, Add2, [ 128,0 ] ]  # 10-P2/4 stream one:x+trans[0]
  - [ [ 8,9 ], 1, Add2, [ 128,1 ] ]  # 11-P2/4 stream two:x+trans[1]

    # Visible
  - [10, 1, Conv, [256, 3, 2]] # 12-P3/8
  - [-1, 6, C2f, [256, True]] # 13
    # infrared
  - [11, 1, Conv, [256, 3, 2]] # 14-P3/8
  - [-1, 6, C2f, [256, True]] # 15

  # transformer fusion
  - [ [ 13,15 ], 1, CFT, [ 256 ] ]   # 16-P3/8
  - [ [ 13,16 ], 1, Add2, [ 256,0 ] ]    # 17-P3/8 stream one x+trans[0]
  - [ [ 15,16 ], 1, Add2, [ 256,1 ] ]    # 18-P3/8 stream two x+trans[1]

    # Visible
  - [17, 1, SCDown, [512, 3, 2]] # 19-P4/16
  - [-1, 6, C2f, [512, True]] # 20
    # infrared
  - [18, 1, SCDown, [512, 3, 2]] # 21-P4/16
  - [-1, 6, C2f, [512, True]] # 22

  # transformer fusion
  - [ [ 20,22 ], 1, CFT, [ 512 ] ]   # 23-P3/8
  - [ [ 20,23 ], 1, Add2, [ 512,0 ] ]    # 24-P3/8 stream one x+trans[0]
  - [ [ 22,23 ], 1, Add2, [ 512,1 ] ]    # 25-P3/8 stream two x+trans[1]

    # Visible
  - [24, 1, SCDown, [1024, 3, 2]] # 26-P5/32
  - [-1, 3, C2f, [1024, True]] # 27
  - [-1, 1, SPPF, [1024, 5]] # 28
  - [-1, 1, PSA, [1024]] # 29
    # infrared
  - [25, 1, SCDown, [1024, 3, 2]] # 30-P5/32
  - [-1, 3, C2f, [1024, True]] # 31
  - [-1, 1, SPPF, [1024, 5]] # 32
  - [-1, 1, PSA, [1024]] # 33

  - [ [ 17,18 ], 1, Add, [ 1 ] ]   # 34-P3/8 fusion backbone P3
  - [ [ 24,25 ], 1, Add, [ 1 ] ]   # 35-P4/16 fusion backbone P4
  - [ [ 29,33 ], 1, Add, [ 1 ] ]   # 36-P5/32 fusion backbone P5


# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 35], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 39

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 34], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 42 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 39], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 45 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 36], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 48 (P5/32-large)

  - [[42, 45, 48], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
