# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 8-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [768, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 12-P6/64
  - [-1, 3, C2f, [1024, True]]

  - [2, 1, Conv, [64, 3, 2]] # 14-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 15-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 17-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 19-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [768, 3, 2]] # 21-P5/32
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 23-P6/64
  - [-1, 3, C2f, [1024, True]]

  - [[7, 18], 1, Concat, [1]]  # 25 cat backbone P2
  - [[9, 20], 1, Concat, [1]]  # 26 cat backbone P3
  - [[11, 22], 1, Concat, [1]]  # 27 cat backbone P4
  - [[13, 24], 1, Concat, [1]]  # 28 cat backbone P5

  - [-1, 1, SPPF, [1024, 5]] # 29
  - [-1, 1, PSA, [1024]] # 30

# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 27], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [768]] # 33

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 26], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [512]] # 36 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 39 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 36], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 42 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 33], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [768]] # 45 (P4/16-medium)

  - [-1, 1, SCDown, [768, 3, 2]]
  - [[-1, 30], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 48 (P5/32-large)

  - [[39, 42, 45, 48], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
