# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 8-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]

  - [2, 1, Conv, [64, 3, 2]] # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 13-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 15-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 17-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 19-P5/32
  - [-1, 3, C2f, [1024, True]]

  - [[7, 16], 1, Concat, [1]]  # 21 cat backbone P3
  - [[9, 18], 1, Concat, [1]]  # 22 cat backbone P4
  - [[11, 20], 1, Concat, [1]]  # 23 cat backbone P5

  - [-1, 1, SPPF, [1024, 5]] # 24
  - [-1, 1, PSA, [1024]] # 25

# YOLOv10.0n head
head:
  - [25, 1, ChannelAttention_HSFPN, [4]] # 26
  - [-1, 1, nn.Conv2d, [256, 1]] # 27
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 28
 
  - [22, 1, ChannelAttention_HSFPN, [4]] # 29
  - [-1, 1, nn.Conv2d, [256, 1]] # 30
  - [28, 1, ChannelAttention_HSFPN, [4, False]] # 31
  - [[-1, -2], 1, Multiply, []] # 32
  - [[-1, 28], 1, Add_HSFPN, []] # 33
  - [-1, 3, C2fCIB, [256, 1, True]] # 34 P4/16
 
  - [28, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 35
  - [21, 1, ChannelAttention_HSFPN, [4]] # 36
  - [-1, 1, nn.Conv2d, [256, 1]] # 37
  - [35, 1, ChannelAttention_HSFPN, [4, False]] # 38
  - [[-1, -2], 1, Multiply, []] # 39
  - [[-1, 35], 1, Add_HSFPN, []] # 40
  - [-1, 3, C2fCIB, [256, 1, True]] # 41 P3/16

  - [[27, 34, 41], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
