# by: CSDN Limiiiing

ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

    # Visible
  - [1, 1, Conv,  [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 4-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]
    # infrared
  - [2, 1, Conv,  [64, 3, 2]] # 6-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 7-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]

  # transformer fusion
  - [ [ 5,8 ], 1, CAFM, [ 256 ] ] # 9-P2/4
  - [ [ 5,9 ], 1, Add2, [ 256,0 ] ]  # 10-P2/4 stream one:x+trans[0]
  - [ [ 8,9 ], 1, Add2, [ 256,1 ] ]  # 11-P2/4 stream two:x+trans[1]

    # Visible
  - [10, 1, Conv,  [256, 3, 2, 1, 4]] # 12-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]]
    # infrared
  - [11, 1, Conv,  [256, 3, 2, 1, 4]] # 14-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]]

  # transformer fusion
  - [ [ 13,15 ], 1, CAFM, [ 256 ] ]   # 16-P3/8
  - [ [ 13,16 ], 1, Add2, [ 256,0 ] ]    # 17-P3/8 stream one x+trans[0]
  - [ [ 15,16 ], 1, Add2, [ 256,1 ] ]    # 18-P3/8 stream two x+trans[1]

    # Visible
  - [17, 1, DSConv,  [512, 3, 2]] # 19-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
    # infrared
  - [18, 1, DSConv,  [512, 3, 2]] # 21-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]

  # transformer fusion
  - [ [ 20,22 ], 1, CAFM, [ 512 ] ]   # 23-P3/8
  - [ [ 20,23 ], 1, Add2, [ 512,0 ] ]    # 24-P3/8 stream one x+trans[0]
  - [ [ 22,23 ], 1, Add2, [ 512,1 ] ]    # 25-P3/8 stream two x+trans[1]

    # Visible
  - [24, 1, DSConv,  [1024, 3, 2]] # 26-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 27
    # infrared
  - [25, 1, DSConv,  [1024, 3, 2]] # 28-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 29

  - [ [ 17,18 ], 1, Add, [ 1 ] ]   # 30-P3/8 fusion backbone P3
  - [ [ 24,25 ], 1, Add, [ 1 ] ]   # 31-P4/16 fusion backbone P4
  - [ [ 27,29 ], 1, Add, [ 1 ] ]   # 32-P5/32 fusion backbone P5

head:
  - [[30, 31, 32], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [ 33, 1, DownsampleConv, []]
  - [[31, 33], 1, FullPAD_Tunnel, []]  # 36     
  - [[30, 34], 1, FullPAD_Tunnel, []]  # 37    
  - [[32, 35], 1, FullPAD_Tunnel, []] # 38 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 36], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, DSC3k2, [512, True]] # 41
  - [[-1, 33], 1, FullPAD_Tunnel, []]  # 42

  - [41, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 37], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, DSC3k2, [256, True]] # 45
  - [34, 1, Conv, [256, 1, 1]]
  - [[45, 46], 1, FullPAD_Tunnel, []]  # 47
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 42], 1, Concat, [1]] # cat head P4
  - [-1, 2, DSC3k2, [512, True]] # 50
  - [[-1, 33], 1, FullPAD_Tunnel, []]  

  - [50, 1, Conv, [512, 3, 2]]
  - [[-1, 38], 1, Concat, [1]] # cat head P5
  - [-1, 2, DSC3k2, [1024,True]] # 54 (P5/32-large)
  - [[-1, 35], 1, FullPAD_Tunnel, []]  
  
  - [[47, 51, 55], 1, Detect, [nc]] # Detect(P3, P4, P5)
