# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
   n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
   s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
   m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
   l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
   x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2
    # Visible
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]] # 5
    # infrared
  - [2, 1, Conv, [64, 3, 2]] # 6-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 7-P2/4
  - [-1, 3, C2f, [128, True]] # 8
  
  # transformer fusion
  - [ [ 5,8 ], 1, CFT, [ 128 ] ] # 9-P2/4
  - [ [ 5,9 ], 1, Add2, [ 128,0 ] ]  # 10-P2/4 stream one:x+trans[0]
  - [ [ 8,9 ], 1, Add2, [ 128,1 ] ]  # 11-P2/4 stream two:x+trans[1]
  
    # Visible
  - [10, 1, Conv, [256, 3, 2]] # 12-P3/8
  - [-1, 6, C2f, [256, True]] # 13
    # infrared
  - [11, 1, Conv, [256, 3, 2]] # 14-P3/8
  - [-1, 6, C2f, [256, True]] # 15
  
  # transformer fusion
  - [ [ 13,15 ], 1, CFT, [ 256 ] ]   # 16-P3/8
  - [ [ 13,16 ], 1, Add2, [ 256,0 ] ]    # 17-P3/8 stream one x+trans[0]
  - [ [ 15,16 ], 1, Add2, [ 256,1 ] ]    # 18-P3/8 stream two x+trans[1]
  
    # Visible
  - [17, 1, Conv, [512, 3, 2]] # 19-P4/16
  - [-1, 6, C2f, [512, True]] # 20
    # infrared
  - [18, 1, Conv, [512, 3, 2]] # 21-P4/16
  - [-1, 6, C2f, [512, True]] # 22
    
  # transformer fusion
  - [ [ 20,22 ], 1, CFT, [ 512 ] ]   # 23-P3/8
  - [ [ 20,23 ], 1, Add2, [ 512,0 ] ]    # 24-P3/8 stream one x+trans[0]
  - [ [ 22,23 ], 1, Add2, [ 512,1 ] ]    # 25-P3/8 stream two x+trans[1]

    # Visible
  - [-1, 1, Conv, [1024, 3, 2]] # 26-P5/32
  - [-1, 3, C2f, [1024, True]] # 27
  - [-1, 1, SPPF, [1024, 5]] # 28
  
    # infrared
  - [-1, 1, Conv, [1024, 3, 2]] # 29-P5/32
  - [-1, 3, C2f, [1024, True]] # 30
  - [-1, 1, SPPF, [1024, 5]] # 31
  
  # # transformer fusion
  # - [ [ 28,31 ], 1, CFT, [ 1024 ] ]    # 32-P5/32
  # - [ [ 28,32 ], 1, Add2, [ 1024,0 ] ]    # 33-P5/32 stream one x+trans[0]
  # - [ [ 31,32 ], 1, Add2, [ 1024,1 ] ]    # 34-P5/32 stream two x+trans[1]
  
  - [ [ 17,18 ], 1, Add, [ 1 ] ]   # 32-P3/8 fusion backbone P3
  - [ [ 24,25 ], 1, Add, [ 1 ] ]   # 33-P4/16 fusion backbone P4
  - [ [ 28,31 ], 1, Add, [ 1 ] ]   # 34-P5/32 fusion backbone P5


 # YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 33], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 37

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 32], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 40 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 37], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 43 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 34], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 46 (P5/32-large)

  - [[40, 43, 46], 1, Detect, [nc]]  # Detect(P3, P4, P5)
