# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

    # Visible
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 5
    # infrared
  - [2, 1, Conv, [64, 3, 2]] # 6-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 7-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 8

  # transformer fusion
  - [ [ 5,8 ], 1, CFT, [ 128 ] ] # 9-P2/4
  - [ [ 5,9 ], 1, Add2, [ 128,0 ] ]  # 10-P2/4 stream one:x+trans[0]
  - [ [ 8,9 ], 1, Add2, [ 128,1 ] ]  # 11-P2/4 stream two:x+trans[1]

    # Visible
  - [10, 1, Conv, [256, 3, 2]] # 12-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 13
    # infrared
  - [11, 1, Conv, [256, 3, 2]] # 14-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 15

  # transformer fusion
  - [ [ 13,15 ], 1, CFT, [ 256 ] ]   # 16-P3/8
  - [ [ 13,16 ], 1, Add2, [ 256,0 ] ]    # 17-P3/8 stream one x+trans[0]
  - [ [ 15,16 ], 1, Add2, [ 256,1 ] ]    # 18-P3/8 stream two x+trans[1]

    # Visible
  - [17, 1, Conv, [512, 3, 2]] # 19-P4/16
  - [-1, 2, C3k2, [512, True]] # 20
    # infrared
  - [18, 1, Conv, [512, 3, 2]] # 21-P4/16
  - [-1, 2, C3k2, [512, True]] # 22

  # transformer fusion
  - [ [ 20,22 ], 1, CFT, [ 512 ] ]   # 23-P3/8
  - [ [ 20,23 ], 1, Add2, [ 512,0 ] ]    # 24-P3/8 stream one x+trans[0]
  - [ [ 22,23 ], 1, Add2, [ 512,1 ] ]    # 25-P3/8 stream two x+trans[1]

    # Visible
  - [24, 1, Conv, [1024, 3, 2]] # 26-P5/32
  - [-1, 2, C3k2, [1024, True]] # 27
  - [-1, 1, SPPF, [1024, 5]] # 28
  - [-1, 2, C2PSA, [1024]] # 29
    # infrared
  - [25, 1, Conv, [1024, 3, 2]] # 30-P5/32
  - [-1, 2, C3k2, [1024, True]] # 31
  - [-1, 1, SPPF, [1024, 5]] # 32
  - [-1, 2, C2PSA, [1024]] # 33

  # transformer fusion
  - [ [ 29,33 ], 1, CFT, [ 1024 ] ]    # 34-P5/32
  - [ [ 29,34 ], 1, Add2, [ 1024,0 ] ]    # 35-P5/32 stream one x+trans[0]
  - [ [ 33,34 ], 1, Add2, [ 1024,1 ] ]    # 36-P5/32 stream two x+trans[1]

  - [ [ 17,18 ], 1, Add, [ 1 ] ]   # 37-P3/8 fusion backbone P3
  - [ [ 24,25 ], 1, Add, [ 1 ] ]   # 38-P4/16 fusion backbone P4
  - [ [ 35,36 ], 1, Add, [ 1 ] ]   # 39-P5/32 fusion backbone P5

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 38], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 42

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 37], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 45 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 42], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 48 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 39], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 51 (P5/32-large)

  - [[45, 48, 51], 1, Detect, [nc]] # Detect(P3, P4, P5)
