# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 8-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

  - [2, 1, Conv, [64, 3, 2]] # 14-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 15-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 17-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 19-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 21-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 23
  - [-1, 2, C2PSA, [1024]] # 24

# YOLO11n head
head:
  - [13, 1, ChannelAttention_HSFPN, [4]] # 25
  - [-1, 1, nn.Conv2d, [256, 1]] # 26
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 27
 
  - [9, 1, ChannelAttention_HSFPN, [4]] # 28
  - [-1, 1, nn.Conv2d, [256, 1]] # 29
  - [27, 1, ChannelAttention_HSFPN, [4, False]] # 30
  - [[-1, -2], 1, Multiply, []] # 31
  - [[-1, 27], 1, Add_HSFPN, []] # 32
  - [-1, 2, C3k2, [256, 1, True]] # 33 P4/16
 
  - [27, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 34
  - [7, 1, ChannelAttention_HSFPN, [4]] # 35
  - [-1, 1, nn.Conv2d, [256, 1]] # 36
  - [34, 1, ChannelAttention_HSFPN, [4, False]] # 37
  - [[-1, -2], 1, Multiply, []] # 38
  - [[-1, 34], 1, Add_HSFPN, []] # 39
  - [-1, 2, C3k2, [256, 1, True]] # 40 P3/16


  - [24, 1, ChannelAttention_HSFPN, [4]] # 41
  - [-1, 1, nn.Conv2d, [256, 1]] # 42
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 43
 
  - [20, 1, ChannelAttention_HSFPN, [4]] # 44
  - [-1, 1, nn.Conv2d, [256, 1]] # 45
  - [43, 1, ChannelAttention_HSFPN, [4, False]] # 46
  - [[-1, -2], 1, Multiply, []] # 47
  - [[-1, 43], 1, Add_HSFPN, []] # 48
  - [-1, 2, C3k2, [256, 1, True]] # 49 P4/16
 
  - [43, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 50
  - [18, 1, ChannelAttention_HSFPN, [4]] # 51
  - [-1, 1, nn.Conv2d, [256, 1]] # 52
  - [50, 1, ChannelAttention_HSFPN, [4, False]] # 53
  - [[-1, -2], 1, Multiply, []] # 54
  - [[-1, 50], 1, Add_HSFPN, []] # 55
  - [-1, 2, C3k2, [256, 1, True]] # 56 P3/16


  - [[26, 42], 1, Concat, [1]]  # cat head P5  57
  - [[33, 49], 1, Concat, [1]]  # cat head P5  58
  - [[40, 56], 1, Concat, [1]]  # cat head P5  59

  - [[57, 58, 59], 1, Detect, [nc]] # Detect(P3, P4, P5)
