# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs


# YOLO12 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv,  [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 4-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 6-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 8-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 10-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 11

  - [2, 1, Conv,  [64, 3, 2]] # 12-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 13-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 15-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 17-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 19-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 20

# YOLO12 head
head:
  - [11, 1, ChannelAttention_HSFPN, [4]] # 21
  - [-1, 1, nn.Conv2d, [256, 1]] # 22
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 23
 
  - [9, 1, ChannelAttention_HSFPN, [4]] # 24
  - [-1, 1, nn.Conv2d, [256, 1]] # 25
  - [23, 1, ChannelAttention_HSFPN, [4, False]] # 26
  - [[-1, -2], 1, Multiply, []] # 27
  - [[-1, 23], 1, Add_HSFPN, []] # 28
  - [-1, 2, A2C2f, [256, False, -1]] # 29 P4/16
 
  - [23, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 30
  - [7, 1, ChannelAttention_HSFPN, [4]] # 31
  - [-1, 1, nn.Conv2d, [256, 1]] # 32
  - [30, 1, ChannelAttention_HSFPN, [4, False]] # 33
  - [[-1, -2], 1, Multiply, []] # 34
  - [[-1, 30], 1, Add_HSFPN, []] # 35
  - [-1, 2, C3k2, [256, True]] # 36 P3/16


  - [20, 1, ChannelAttention_HSFPN, [4]] # 37
  - [-1, 1, nn.Conv2d, [256, 1]] # 38
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 39
 
  - [18, 1, ChannelAttention_HSFPN, [4]] # 40
  - [-1, 1, nn.Conv2d, [256, 1]] # 41
  - [39, 1, ChannelAttention_HSFPN, [4, False]] # 42
  - [[-1, -2], 1, Multiply, []] # 43
  - [[-1, 39], 1, Add_HSFPN, []] # 44
  - [-1, 2, A2C2f, [256, False, -1]] # 45 P4/16
 
  - [39, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 46
  - [16, 1, ChannelAttention_HSFPN, [4]] # 47
  - [-1, 1, nn.Conv2d, [256, 1]] # 48
  - [46, 1, ChannelAttention_HSFPN, [4, False]] # 49
  - [[-1, -2], 1, Multiply, []] # 50
  - [[-1, 46], 1, Add_HSFPN, []] # 51
  - [-1, 2, C3k2, [256, True]] # 52 P3/16


  - [[22, 38], 1, Concat, [1]]  # cat head P5  53
  - [[29, 45], 1, Concat, [1]]  # cat head P5  54
  - [[36, 52], 1, Concat, [1]]  # cat head P5  55

  - [[53, 54, 55], 1, Detect, [nc]] # Detect(P3, P4, P5)
