# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 3-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 4
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 5
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 6-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 7
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 8-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 9-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 10-P5
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 11-P5

  - [2, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 12-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 13
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 14
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 15-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 16
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 17-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 18-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 19-P5
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 20-P5



head:
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 21 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 23, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 24
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 25 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 27, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 28, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 29
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 30 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 31 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (32), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 33
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 34 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 35 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (36), fpn_blocks.1

  - [20, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 37 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 39, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 40
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 41 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 43, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 44, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 45
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 46 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 47 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (48), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 49
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 50 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 51 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (52), fpn_blocks.1

  - [[23, 39], 1, Concat, [1]]  # 53 cat backbone P3
  - [[28, 44], 1, Concat, [1]]  # 54 cat backbone P3
  - [[32, 48], 1, Concat, [1]]  # 55 cat backbone P4
  - [[36, 52], 1, Concat, [1]]  # 56 cat backbone P5

  - [-1, 1, Conv, [256, 3, 2]]  # 57, downsample_convs.0
  - [[-1, 55], 1, Concat, [1]]  # 58 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (59), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 60, downsample_convs.0
  - [[-1, 54], 1, Concat, [1]]  # 61 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (62), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 63, downsample_convs.1
  - [[-1, 53], 1, Concat, [1]]  # 64 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (65), pan_blocks.1
 
  - [[56, 59, 62, 65], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
