# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

    # Visible
  - [1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 3-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 4
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 5
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 6-P2
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 7
    # infrared
  - [2, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 8-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 11-P2
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 12
  # transformer fusion
  - [ [ 7,12 ], 1, CFT, [ 64 ] ] # 13-P2/4
  - [ [ 7,13 ], 1, Add2, [ 64,0 ] ]  # 14-P2/4 stream one:x+trans[0]
  - [ [ 12,13 ], 1, Add2, [ 64,1 ] ]  # 15-P2/4 stream two:x+trans[1]

    # Visible
  - [14, 2, Blocks, [128, BasicBlock, 3, False]] # 16-P3
    # infrared
  - [15, 2, Blocks, [128, BasicBlock, 3, False]] # 17-P3
  # transformer fusion
  - [ [ 16,17 ], 1, CFT, [ 128 ] ]   # 18-P3/8
  - [ [ 16,18 ], 1, Add2, [ 128,0 ] ]    # 19-P3/8 stream one x+trans[0]
  - [ [ 17,18 ], 1, Add2, [ 128,1 ] ]    # 20-P3/8 stream two x+trans[1]

    # Visible
  - [19, 2, Blocks, [256, BasicBlock, 4, False]] # 21-P4
    # infrared
  - [20, 2, Blocks, [256, BasicBlock, 4, False]] # 22-P4
  # transformer fusion
  - [ [ 21,22 ], 1, CFT, [ 256 ] ]   # 23-P3/8
  - [ [ 21,23 ], 1, Add2, [ 256,0 ] ]    # 24-P3/8 stream one x+trans[0]
  - [ [ 22,23 ], 1, Add2, [ 256,1 ] ]    # 25-P3/8 stream two x+trans[1]

    # Visible
  - [24, 2, Blocks, [512, BasicBlock, 5, False]] # 26-P5
    # infrared
  - [25, 2, Blocks, [512, BasicBlock, 5, False]] # 27-P5
  # transformer fusion
  - [ [ 26,27 ], 1, CFT, [ 1024 ] ]    # 28-P5/32
  - [ [ 26,28 ], 1, Add2, [ 1024,0 ] ]    # 29-P5/32 stream one x+trans[0]
  - [ [ 27,28 ], 1, Add2, [ 1024,1 ] ]    # 30-P5/32 stream two x+trans[1]

  - [[19, 20], 1, Concat, [1]]  # 31 cat backbone P3
  - [[24, 25], 1, Concat, [1]]  # 32 cat backbone P4
  - [[29, 30], 1, Concat, [1]]  # 33 cat backbone P5

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 34 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 36, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 37
  - [32, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 38 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 40, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 41, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 42
  - [31, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 43 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 44 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (45), fpn_blocks.1
 
  - [-1, 1, Conv, [256, 3, 2]]  # 46, downsample_convs.0
  - [[-1, 41], 1, Concat, [1]]  # 47 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (48), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 49, downsample_convs.1
  - [[-1, 36], 1, Concat, [1]]  # 50 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (51), pan_blocks.1
 
  - [[45, 48, 51], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
