# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, MF, [32]]  # 0
  - [-1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 1-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 2
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 3
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 4-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 5
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 6-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 7-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 8-P5
 
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 15, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 16, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 18 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 19 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (20), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 22 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 23 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (24), fpn_blocks.1
 
  - [-1, 1, Conv, [256, 3, 2]]  # 25, downsample_convs.0
  - [[-1, 20], 1, Concat, [1]]  # 26 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (27), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 28, downsample_convs.0
  - [[-1, 16], 1, Concat, [1]]  # 29 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (30), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 31, downsample_convs.1
  - [[-1, 11], 1, Concat, [1]]  # 32 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (33), pan_blocks.1
 
  - [[24, 27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
