# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 3-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 4
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 5
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 6-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 7
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 8-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 9-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 10-P5

  - [2, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 11-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 12
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 13
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 14-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 15
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 16-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 17-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 18-P5

  - [[7, 15], 1, Concat, [1]]  # 19 cat backbone P3
  - [[8, 16], 1, Concat, [1]]  # 20 cat backbone P3
  - [[9, 17], 1, Concat, [1]]  # 21 cat backbone P4
  - [[10, 18], 1, Concat, [1]]  # 22 cat backbone P5

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 23 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 25, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 26
  - [21, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 27 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 29, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 30, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 31
  - [20, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 32 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 33 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (34), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 35
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 36 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 37 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (38), fpn_blocks.1
 
  - [-1, 1, Conv, [256, 3, 2]]  # 39, downsample_convs.0
  - [[-1, 34], 1, Concat, [1]]  # 40 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (41), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 42, downsample_convs.0
  - [[-1, 30], 1, Concat, [1]]  # 43 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (44), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 45, downsample_convs.1
  - [[-1, 25], 1, Concat, [1]]  # 46 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (47), pan_blocks.1
 
  - [[38, 41, 44, 47], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
