# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 3-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 4
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 5
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 6-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 7
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 8-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 9-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 10-P5

  - [2, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 11-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 12
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 13
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 14-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 15
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 16-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 17-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 18-P5

head:
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 20
  - [-1, 1, Conv, [256, 1, 1]]  # 21, Y5, lateral_convs.0

  - [-1, 1, ChannelAttention_HSFPN, []] # 22
  - [-1, 1, nn.Conv2d, [256, 1]] # 23
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 24

  - [9, 1, ChannelAttention_HSFPN, []] # 25
  - [-1, 1, nn.Conv2d, [256, 1]] # 26
  - [24, 1, ChannelAttention_HSFPN, [4, False]] # 27
  - [[-1, -2], 1, Multiply, []] # 28
  - [[-1, 24], 1, Add, []] # 29
  - [-1, 3, RepC3, [256, 0.5]] # 30 P4/16

  - [24, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1, 16]] # 31
  - [8, 1, ChannelAttention_HSFPN, []] # 32
  - [-1, 1, nn.Conv2d, [256, 1]] # 33
  - [31, 1, ChannelAttention_HSFPN, [4, False]] # 34
  - [[-1, -2], 1, Multiply, []] # 35
  - [[-1, 31], 1, Add, []] # 36
  - [-1, 3, RepC3, [256, 0.5]] # 37 P3/8

  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 38 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 39
  - [-1, 1, Conv, [256, 1, 1]]  # 40, Y5, lateral_convs.0

  - [-1, 1, ChannelAttention_HSFPN, []] # 41
  - [-1, 1, nn.Conv2d, [256, 1]] # 42
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 43

  - [17, 1, ChannelAttention_HSFPN, []] # 44
  - [-1, 1, nn.Conv2d, [256, 1]] # 45
  - [43, 1, ChannelAttention_HSFPN, [4, False]] # 46
  - [[-1, -2], 1, Multiply, []] # 47
  - [[-1, 43], 1, Add, []] # 48
  - [-1, 3, RepC3, [256, 0.5]] # 49 P4/16

  - [43, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1, 16]] # 50
  - [16, 1, ChannelAttention_HSFPN, []] # 51
  - [-1, 1, nn.Conv2d, [256, 1]] # 52
  - [50, 1, ChannelAttention_HSFPN, [4, False]] # 53
  - [[-1, -2], 1, Multiply, []] # 54
  - [[-1, 50], 1, Add, []] # 55
  - [-1, 3, RepC3, [256, 0.5]] # 56 P3/8

  - [[24, 43], 1, Concat, [1]]  # 55 cat backbone P3
  - [[30, 49], 1, Concat, [1]]  # 56 cat backbone P4
  - [[37, 56], 1, Concat, [1]]  # 57 cat backbone P5

  - [[55, 56, 57], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
