# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 3-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 4
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 5
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 6-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 7
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 8-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 9-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 10-P5
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 11-P5

  - [2, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 12-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 13
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 14
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 15-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 16
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 17-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 18-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 19-P5
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 20-P5

head:
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 21 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 23, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 24
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 25 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 27, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 28, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 29
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 30 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 31 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (32), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 33
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 34 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 35 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (36), fpn_blocks.1
 
  - [-1, 1, Conv, [256, 3, 2]]  # 37, downsample_convs.0
  - [[-1, 32], 1, Concat, [1]]  # 38 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (39), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 40, downsample_convs.0
  - [[-1, 28], 1, Concat, [1]]  # 41 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (42), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 43, downsample_convs.1
  - [[-1, 23], 1, Concat, [1]]  # 44 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (45), pan_blocks.1

  - [20, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 46 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 48, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 49
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 50 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 52, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 53, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 54
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 55 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 56 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (57), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 58
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 59 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 60 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (61), fpn_blocks.1
 
  - [-1, 1, Conv, [256, 3, 2]]  # 62, downsample_convs.0
  - [[-1, 57], 1, Concat, [1]]  # 63 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (64), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 65, downsample_convs.0
  - [[-1, 53], 1, Concat, [1]]  # 66 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (67), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 68, downsample_convs.1
  - [[-1, 48], 1, Concat, [1]]  # 69 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # 70 (49), pan_blocks.1

  - [[36, 61], 1, Concat, [1]]  # 71 cat backbone P3
  - [[39, 64], 1, Concat, [1]]  # 72 cat backbone P3
  - [[42, 67], 1, Concat, [1]]  # 73 cat backbone P4
  - [[45, 70], 1, Concat, [1]]  # 74 cat backbone P5

  - [[71, 72, 73, 74], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
