# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 3-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 4
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 5
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 6-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 7
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 8-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 9-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 10-P5

  - [2, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 11-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 12
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 13
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 14-P2
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 15
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 16-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 17-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 18-P5

head:
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 21, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 22
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 23 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 25, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 26, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 27
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 28 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 29 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (30), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 31
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 32 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 33 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (34), fpn_blocks.1

  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 35 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 37, Y5, lateral_convs.0
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 38
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 39 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 41, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 42, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 43
  - [16, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 44 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 45 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (46), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 47
  - [15, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 48 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 49 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # X3 (50), fpn_blocks.1

  - [[21, 37], 1, Concat, [1]]  # 51 cat backbone P3
  - [[26, 42], 1, Concat, [1]]  # 52 cat backbone P3
  - [[30, 46], 1, Concat, [1]]  # 53 cat backbone P4
  - [[34, 50], 1, Concat, [1]]  # 54 cat backbone P5

  - [-1, 1, Conv, [256, 3, 2]]  # 55, downsample_convs.0
  - [[-1, 53], 1, Concat, [1]]  # 56 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (57), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 58, downsample_convs.0
  - [[-1, 52], 1, Concat, [1]]  # 59 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]  # F4 (60), pan_blocks.0
 
  - [-1, 1, Conv, [256, 3, 2]]  # 61, downsample_convs.1
  - [[-1, 51], 1, Concat, [1]]  # 62 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]  # F5 (63), pan_blocks.1
 
  - [[54, 57, 60, 63], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
